---
kind: type
id: T:Autodesk.Revit.DB.DatumExtentType
source: html/7a968bc3-1860-6a8b-6f3a-2b23b80a56a5.htm
---
# Autodesk.Revit.DB.DatumExtentType

Represents the type of datum extent that is displayed in a particular view.

## Syntax (C#)
```csharp
public enum DatumExtentType
```